//Уровень 1.1 задачника JavaScript
//1 Дано число. Проверьте, отрицательное оно или нет.
//Выведите об этом информацию в консоль.
console.log("1.1 #1");

let num = 8;
let num2 = -5;
console.log(num, num > 0 ? "більше нуля" : " меньше нуля");
console.log(num2, num2 > 0 ? "більше нуля" : " меньше нуля");

//Дана строка. Выведите в консоль длину этой строки
console.log("1.1 #2");

let str = "Hello!!!";
console.log(str, str.length);

//Дана строка. Выведите в консоль последний символ строки.
console.log("1.1 #3");

str = "Hello!";
console.log(str[str.length - 1]);

//Дано число. Проверьте, четное оно или нет
console.log("1.1 #4");

num = 7;
console.log(num, num % 2 === 0 ? "четное" : "не четное");
num = 8;
console.log(num, num % 2 === 0 ? "четное" : "не четное");

//Даны два слова. Проверьте, что первые буквы этих слов совпадают.
console.log("1.1 #5");

let word1 = "Hello";
let word2 = "Hello";

console.log(word1[0] === word2[0] ? "yes" : "no");

//Дано слово. Получите его последнюю букву.
//Если слово заканчивается на мягкий знак, то получите предпоследнюю букву.
console.log("1.1 #6");

word1 = "Лінь";
word2 = "Кіт";

if (word1[word1.length - 1] === "ь") {
  console.log(word1, word1[word1.length - 2]);
} else {
  console.log(word1, word1[word1.length - 1]);
}

if (word2[word2.length - 1] === "ь") {
  console.log(word2, word2[word2.length - 2]);
} else {
  console.log(word2, word2[word2.length - 1]);
}

////////////////////////////////////////////////
/// Уровень 1.2 задачника JavaScript////////////

//1 Дано число. Выведите в консоль первую цифру этого числа
console.log("1.2 #1");

num = 5678;
// if (num < 0) num * -1;
// str = num+"";
console.log(num, +(num + "")[0]);

//2 Дано число. Выведите в консоль последнюю цифру этого числа
console.log("1.2 #2");

num = 5678;
console.log(num, num % 10);

//3 Дано число.
//Выведите в консоль сумму первой и последней цифры этого числа.
console.log("1.2 #3");

num = 5678;
console.log(num, +(num + "")[0] + (num % 10));

//4 Дано число.
//Выведите количество цифр в этом числе
console.log("1.2 #4");

num = 1234567;
num2 = num;
let count = 0;
while (num > 0) {
  if (num > 10) {
    num /= 10;
    count++;
  } else {
    count++;
    num = 0;
  }
}
console.log(num2, count);

//5 Даны два числа.
//Проверьте, что первые цифры этих чисел совпадают
console.log("1.2 #4");

console.log(+(78905 + "")[0] === +(700 + "")[0]);

////////////////////////////////////////////////
/// Уровень 1.3 задачника JavaScript////////////

//1 Дана строка.
//Если в этой строке более одного символа,
//выведите в консоль предпоследний символ этой строки.
console.log("1.3 #1");

str = "Hello world!";
if (str.length > 1) {
  console.log(str, str[str.length - 2]);
}

//2 Даны два целых числа
//Проверьте, что первое число без остатка делится на второе.
console.log("1.3 #2");

let num1 = 121;
num2 = 11;

console.log(num1 % num2 === 0);

////////////////////////////////////////////////
/// Уровень 1.4 задачника JavaScript////////////

//1 Выведите в консоль все целые числа от 1 до 100
console.log("1.4 #1");
//1 2 3 ... 98 99 100 скоротив вивід,
//щоб не стільки багато цифр вивело
for (i = 1; i <= 100; i++) {
  if (i <= 3 || i >= 98) console.log(i);
}

//2 Выведите в консоль все целые числа от -100 до 0.
console.log("1.4 #2");

//-100 -99 -98 ... -2 -1 0 скоротив вивід,
//щоб не стільки багато цифр вивело
for (i = -100; i <= 0; i++) {
  if (i <= -98 || i >= -2) console.log(i);
}

//3 Выведите в консоль все целые числа от 100 до 1.
console.log("1.4 #3");

for (i = 100; i > 0; i--) {
  if (i >= 98 || i <= 3) console.log(i);
}

//4 Выведите в консоль все четные числа из промежутка от 1 до 100.
console.log("1.4 #4");

for (i = 1; i <= 100; i++) {
  //скоротив вивід
  if ((i <= 6 || i >= 95) && i % 2 === 0) console.log(i);
}

//5 Выведите в консоль все числа кратные трем в промежутке от 1 до 100.
console.log("1.4 #5");

for (i = 1; i <= 100; i++) {
  //скоротив вивід
  if ((i <= 10 || i >= 92) && i % 3 === 0) console.log(i);
}

////////////////////////////////////////////////
/// Уровень 1.5 задачника JavaScript////////////

//1 Найдите сумму всех целых чисел от 1 до 100
console.log("1.5 #1");
let sum = 0;
for (i = 1; i <= 100; i++) sum += i;
console.log(sum);

//2 Найдите сумму всех целых четных чисел в промежутке от 1 до 100.
console.log("1.5 #2");
sum = 0;
for (i = 1; i <= 100; i++) if (i % 2 === 0) sum += i;
console.log(sum);

//3 Найдите сумму всех целых нечетных чисел в промежутке от 1 до 100
console.log("1.5 #3");

sum = 0;
for (i = 1; i <= 100; i++) if (i % 2 === 1) sum += i;
console.log(sum);

//4 Даны два целых числа.
// Найдите остаток от деления первого числа на второе.
console.log("1.5 #4");

num1 = 27;
num2 = 5;
console.log(num1, "%", num2, " = ", num1 % num2);

//5 Дана некоторая строка
// Переберите и выведите в консоль по очереди
// все символы с конца строки.
console.log("1.5 #5");

str = "World!";
for (i = 0; i < str.length; i++) console.log(str[i]);

////////////////////////////////////////////////
/// Уровень 1.6 задачника JavaScript////////////

//1 Дан массив с числами
//Найдите сумму квадратов элементов этого массива.
console.log("1.6 #1");

arr = [1, 2, 3, 4, 5];

sum = 0;
for (i = 0; i < arr.length; i++) sum += arr[i] ** 2;
console.log(sum);

//2 Дан массив с числами
// Найдите сумму квадратных корней элементов этого массива.
console.log("1.6 #2");

arr = [1, 2, 3, 4, 5];

sum = 0;
for (i = 0; i < arr.length; i++) sum += Math.sqrt(arr[i]);
console.log(sum);

//3 Дан массив с числами
// Найдите сумму положительных элементов этого массива.
console.log("1.6 #3");

arr = [4, -7, 8, -9, 10];

sum = 0;
for (i = 0; i < arr.length; i++) if (arr[i] > 0) sum += arr[i];
console.log(sum);

//4 Дан массив с числами
// Найдите сумму тех элементов этого массива
//, которые больше нуля и меньше десяти.
console.log("1.6 #4");

arr = [4, -7, 8, -9, 10];
sum = 0;
for (i = 0; i < arr.length; i++) if (arr[i] > 0 && arr[i] < 10) sum += arr[i];
console.log(sum);

////////////////////////////////////////////////
/// Уровень 1.7 задачника JavaScript////////////

//1 Дана строка:
// 'abcde'
//Получите массив букв этой строки.
console.log("1.7 #1");

console.log("abcde".split(""));

//2 Дано некоторое число:
// 12345
//Получите массив букв этой строки.
console.log("1.7 #2");

console.log((12345 + "").split(""));

//3 Дано некоторое число: 12345
//Переверните его:        54321
console.log("1.7 #3");

console.log(Number((12345 + "").split("").reverse().join("")));

//4 Дано некоторое число: 12345
//Найдите сумму цифр этого числа
console.log("1.7 #4");

// num = 12345;
// str = num + "";
// arr = str.split("");
// arr = arr.map(Number);
// sum = 0;
// for (i = 0; i < arr.length; i++) sum += arr[i];

num = 12345;
sum = (num + "")
  .split("")
  .map(Number)
  .reduce((acc, e) => acc + e, 0);

console.log(num, sum);

////////////////////////////////////////////////
/// Уровень 1.8 задачника JavaScript////////////

//1 Заполните массив целыми числами от 1 до 10.
console.log("1.8 #1");

arr = [];
let iter = 1;
while (arr.length < 10) {
  arr.push(iter);
  iter++;
}
console.log(arr);

//2 Заполните массив четными числами из промежутка от 1 до 100
console.log("1.8 #2");

arr = [];
iter = 1;
while (arr.length < 100) {
  arr.push(iter);
  iter++;
}
console.log(arr);

//3 Дан массив с дробями: [1.456, 2.125, 3.32, 4.1, 5.34]
//  Округлите эти дроби до одного знака в дробной части.
console.log("1.8 #3");

arr = [1.456, 2.125, 3.32, 4.1, 5.34];
arr = arr.map((e) => Number(e.toFixed(1)));
console.log(arr);

////////////////////////////////////////////////
/// Уровень 1.9 задачника JavaScript////////////

//1 Дан массив со строками
//  Оставьте в этом массиве только те строки,
//  которые начинаются на http://
console.log("1.9 #1");

arr = ["Hello!", "http://www.google.com/", "world!!!", "http://www.site.com/"];

arr2 = [];
for (let i = 0; i < arr.length; i++) {
  if (arr[i].startsWith("http://")) {
    arr2.push(arr[i]);
  }
}
console.log(arr2);

//2 Дан массив со строками
//  Оставьте в этом массиве только те строки,
//  которые заканчиваются на .html
console.log("1.9 #2");
arr = [
  "Hello.html",
  "http://www.google.com/",
  "world.html",
  "http://www.site.com/",
];

arr2 = [];
for (let i = 0; i < arr.length; i++) {
  if (arr[i].endsWith(".html")) {
    arr2.push(arr[i]);
  }
}
console.log(arr2);

//3  Дан массив с числами.
//Увеличьте каждое число из массива на 10 процентов.
console.log("1.9 #3");

arr = [7, 9, 3, 5, 7, 2, 4];
arr = arr.map((e) => e + e / 10);
console.log(arr);

////////////////////////////////////////////////
/// Уровень 1.10 задачника JavaScript////////////

//1 Заполните массив случайными числами
//  из промежутка от 1 до 100.
console.log("1.10 #1");

arr = [];
for (let i = 0; i < 10; i++) arr.push(Math.ceil(Math.random() * 100));
console.log(arr);

//2 Дано некоторое число: 12345
// Выведите в консоль все его символы с конца.
console.log("1.10 #2");

str = 12345 + "";
for (let i = str.length - 1; i >= 0; i--) console.log(str[i]);
//як вариант > str > .split('') > .reverse() > .forEach(e=>cons.log(Number(e))) його вивести.

//3 Дан некоторый массив, например, вот такой: [1, 2, 3, 4, 5, 6]
//По очереди выведите в консоль подмассивы из двух элементов нашего массива:
//[1, 2]
//[3, 4]
//[5, 6]
console.log("1.10 #3");

arr = [1, 2, 3, 4, 5, 6];

for (let i = 0; i < arr.length; i += 2) {
  // console.log([arr[i], arr[i + 1]]); - як варіант
  arr2 = [];
  arr2.push(arr[i]);
  arr2.push(arr[i + 1]);
  console.log(arr2);
}

//4 Даны два массива:
// let arr1 = [1, 2, 3];
// let arr2 = [4, 5, 6];
// Слейте эти массивы в новый массив:
// [1, 2, 3, 4, 5, 6]
console.log("1.10 #4");
arr1 = [1, 2, 3];
arr2 = [4, 5, 6];
arr3 = [];
arr3 = [...arr1, ...arr2];
console.log(arr3);
//arr3 = arr1.concat(arr2) чи через for of arr3.push(i) по першому та другому масиву

//////////////////////////////////////////////////////////////
////////////////////////////////////////////////
/// Уровень 2.1 задачника JavaScript////////////

//1 Дана некоторая строка. Найдите позицию первого нуля в строке.
console.log("2.1 #1");

str = "nhl0uvn0h";
for (let i = 0; i < str.length; i++) {
  if (str[i] === "0") {
    console.log(i + 1);
    break;
  }
}

//2 Выведите в консоль все числа в промежутке от 1 до 1000,
//  сумма первой и второй цифры которых равна пяти.
console.log("2.1 #2");
arr = [];
for (let index = 0; index <= 1000; index++) {
  if (index > 9) {
    str = index + "";
    if (Number(str[0]) + Number(str[1]) === 5) arr.push(index);
  }
}
console.log(arr.join(", "));

//3 Дан массив. Удалите из него элементы с заданным значением
console.log("2.1 #3");

arr = [1, 2, 3, 4, 5, 6];
arr2 = arr.filter((el) => el % 2 === 0);

console.log(arr2);
